package com.example.user.assignment2;

public class Stricks {
    private int index;
    public String[] sticks = {
            "ใบที่หนึ่งสมมาตรปรารถนาทายไว้ว่ามีคนชุบอุปถัมภ์\n" +
                    "หมายสิ่งใดในจิตคิดว่าจะทำ\n" +
                    "ว่าคงสำเร็จการประมาณมี\n" +
                    "แต่ช้าช้าจึงจะสมอารมณ์ปอง\n" +
                    "ททั้งพวกพ้องปรีดิ์เปรมเกษมศรี\n" +
                    "ว่าอยู่เย็นเป็นสุขทุกเดือนปี\n" +
                    "แม้นใบนี้ถามโรคที่โศกกาย\n" +
                    "ว่าคงหายเบาบางเหมือนอย่างทายกัน\n" +
                    "หรือถามหาลูกหนี้พี่น้องหาย\n" +
                    "ว่าคงจะพบพักตร์เหมือนทักทาย\n" +
                    "หรือถามหมายหาลาภไม่หยาบคำ\n" +
                    "ว่าช้าช้าคงสมอารมณ์นึก"+
                    "ได้ก้องกึกเหล่ากอเป็นข้อขำ\n" +
                    "ถามหาคู่ดีนักเหมือนชักนำ\n",
            "ใบที่สองต้องกันเหมือนมั่นหมาย\n" +
                    "แล้วก็กลายกลับฟื้นคืนดังเดิม\n" +
                    "ได้ผลิดอกออกช่อละออสม\n" +
                    "น้ำค้างพรมชื่นเชยรำเพยเสริม\n" +
                    "เหมือนกระจกบานเก่าเมื่อคราวเดิม\n" +
                    "ต้องเพิ่มเติมขัดถูจึงดูงาม\n" +
                    "จะทำการสิ่งใดตั้งใจมั่น \n" +
                    "พร้อมใจกันหารือนับถือถาม"+
                    "จักสมอารมณ์ปองทำนองความ  \n" +
                    " ใบนี้ถามป่วยไข้ว่าได้คลาย \n" +
                    "ถามลูกหนี้พี่น้องพบประสบสม  \n" +
                    "ถามเรื่องคู่ชู้ชมไม่สมหมาย  \n" +
                    "ถามหาลาภว่าดีพาทีทาย \n" ,
            "ใบที่สามเสร็จหวังดังประสงค์\n" +
                    "ที่จำนงค์เสร็จแน่ไม่แปรผัน\n" +
                    "อีกไม่ช้าม้าตัวทองของสำคัญ\n" +
                    "จะพาผันสู่สถานสำราญใจ\n" +
                    "คนที่หนีของที่หายก็ได้กลับ\n" +
                    "คู่ที่ลับห่างชิดพิศมัย\n" +
                    "จะกลับคืนชื่นชิดสนิทใน\n" +
                    "คิดสิ่งใดก็เสร็จสำเร็จการ\n" +
                    "ตามตำราทายว่าพระราเมศร์\n" +
                    "ได้ขวัญเนตรสีดามาสถาน\n" +
                    "ตั้งแต่นี้มีสุขทุกข์ไม่พาน\n" +
                    "ที่คิดการหามิตรสมคิดเอย\n",
            "ใบที่สี่นี้ว่าไว้\n" +
                    "คุณจะมีเหตุให้ต้องห่างไกลจากคนรัก\n" +
                    "จากที่เคยอยู่เคียงคู่กันมานาน\n" +
                    "จะต้องพลัดพรากจากกันไปไกล \n" +
                    "นานครั้งจึงจะมีโอกาสได้เจอกันบ้างด้านการงาน\n" +
                    "คุณจะได้เลื่อนขั้น เลื่อนยศ เลื่อนตำแหน่ง\n" +
                    "โครงการอะไรที่วางแผนเอาไว้จะประสบผลสำเร็จ\n" +
                    "แต่ให้ระวัง ไม่ควรทำอะไรเกินหน้าเกินตาใคร\n" +
                    "จะทำอะไรต้องระวังตัวให้ดี \n" +
                    "ทางด้านของสุขภาพร่างกาย\n" +
                    "จากที่เจ็บป่วยไม่สบายจะหายในเร็ววัน\n" +
                    "ในเรื่องของคดีความนั้น\n" +
                    "ไม่ต้องเป็นกังวลใจ \n" +
                    "เพราะชนะคดีแน่นอน\n" +
                    "ในส่วนของลูกหนี้ที่เคยหยิบยืมเงินไปแล้วหนีหาย\n" +
                    "จะยังไม่กลับเอาเงินมาคืน\n" +
                    "ตามที่ได้หวังไว้ \n" +
                    "สำหรับพ่อแม่ที่หวังจะได้ลูก\n" +
                    "ทายว่าจะได้ลูกชายสมหวังดั่งใจ\n" ,
            "ใบที่ห้าว่าไว้ในอักษร\n" +
                    "ไม่มีใครทำร้ายขจายจรอย่าทุกข์ร้อนไปเลยไม่เคยการ\n" +
                    "ถ้าแม้นรักมักได้ควายของเขา\n" +
                    "ม้าของเราจะต้องพรากจากสถาน\n" +
                    "ถ้าจะคบผู้ใดให้ดูการ\n" +
                    "ถือโบราณแบบเก่าอย่าเบาความ\n" +
                    "แม้นถามหาเนื้อคู่ว่าอยู่ไกล\n" +
                    "ยังไม่ได้เหมือนจิตจงคิดขาม \n" +
                    "ถามลูกหนี้หนีไปในใจความจะติดตามไม่พบประสบกัน\n" +
                    "ถามหาลาภนี้ไซร้ก็ได้ยาก\n" +
                    "ต้องลำบากทุกข์ร้อนจงผ่อนผัน\n" +
                    "แม้นถามบุตรสุดใจที่ในครรภ์ \n" +
                    " เลขห้านั้นว่าหญิงทุกสิ่ง เอยฯ\n" ,
            "ใบที่หกไม่เสร็จเหมือนใจหมาย\n" +
                    "คิดทำการว่านจุนดูวุ่นวาย\n" +
                    "จะหาร้ายใส่ตัวจงกลัวเกรง\n" +
                    "อย่าร้อนใจไปเลยไม่เคยนึก\n" +
                    "ค่อยๆ ตรึกจงเจาะให้เหมาะเหม็ง\n" +
                    "คงสมหมายชมชื่นได้ครื้นเครง\n" +
                    "ตัวเราเองต้องเจียมเสงี่ยมตัว\n" +
                    "ว่าเชือดเนื้อเถือหนัง เราทั้งสิ้น\n" +
                    "จะผันผินมองแผลมีแต่ชั่ว\n" +
                    "ถามคนเจ็บว่าหายสบายตัว\n" +
                    "หรือพันพัวเรื่องความที่ถามมา\n" +
                    "คงชนะทั้งสิ้นอย่ากินแหนง\n" +
                    "ถามเคลือบแคลงลูกหนี้ไม่ดีหนา\n" +
                    "ทั้งเพื่อนฝูงก็ไม่พบประสบตา\n" +
                    "แต่ถามหาลาภใบนี้ไม่ดีเอยฯ",
            "ใบที่เจ็ดเสร็จทุกข์เป็นสุขี \n" +
                    "ญาติมิตรพวกพ้องทั้งสิ้นก็ยินดี\n" +
                    "โชคจักมีมาสนองตามต้องการ\n" +
                    "จงทำบุญให้ทานประสานมิตร\n" +
                    "แล้วอุทิศโภชนากระยาหาร\n" +
                    "ให้เจ้ากรรมนายเวรเป็นพยาน\n" +
                    "จะเบิกบานใจกายสบายจริง\n" +
                    "สร้างกุศลผลบุญไว้หนุนเนื่อง\n" +
                    "จะรุ่งเรืองโภคทรัพย์นับทุกสิ่ง \n" +
                    "ถามหาลาภใบนี้ว่าดีจริง\n" +
                    "ถามถึงสิ่งของหายว่าได้คืน \n" +
                    "ถามหาคู่สู่สมภิรมย์สวาท จะสมมาดคู่ชีวิตจิตสดชื่น\n" +
                    "ถามคนป่วยว่าหายจะคลายคืน\n" +
                    "สำราญรื่นใบที่เจ็ดทายเสร็จ ",
            "ใบที่แปดโชคชะตาว่าปานกลาง\n" +
                    "พอสมอย่างสมตัวไม่มัวหมอง\n" +
                    "ลาภนั้นคงได้สมอารมณ์ปอง\n" +
                    "ว่าเหมาะต้องพอดีไม่มีเกิน\n" +
                    "แต่ถ้าคิดการใหญ่ว่าร้ายอยู่\n" +
                    "จะสุดรู้อัตคัดถึงขัดเขิน\n" +
                    "ต้องลำบากยากเข็ญเช่นบังเอิญ\n" +
                    "อย่าให้เพลินพลั้งสติดำริดู\n" +
                    "เปรียบเช่นเรามีกระบือพาหนะ\n" +
                    "อย่าเอะอะหวังอาชามาเคียงคู่\n" +
                    "มิใช่ บุญวาสนาสง่าชู\n" +
                    "ขืนสู่รู้ร้อนรนต้องรำคาญ\n" +
                    "ใบนี้ถามความดีไม่มีแพ้\n" +
                    "ทายว่าแน่นักชู้คู่สมาน\n" +
                    "เดี๋ยวนี้ยังไม่ได้ประสบพาน\n" +
                    "รออยู่ก่อนเถิดการจะดีเอยฯ",
            "ใบที่เก้าคราวนางประทุมวดี \n" +
                    "จอมบุรีอภิเศกเป็นฝ่ายขวา \n" +
                    "พระโปรดปรานประทานให้ได้นานา\n" +
                    "อวิญญานะกะทรัพย์นับอนันต์\n" +
                    "บริวารยศลาภาดิเรก\n" +
                    "เนื่องอเนกมากจริงทุกสิ่งสรรพ์\n" +
                    "สุขเกษมเปรมปรีดิ์ทุกวี่วัน \n" +
                    "สารพันสมนึกดั่งตรึกตรา\n" +
                    "ถ้าเป็นความทายว่าจะชนะเขา\n" +
                    "ของหายเล่าไม่ต้องตามสืบถามหา\n" +
                    "จะได้คืนอื่นจะเพิ่มซ้ำเติมมา\n" +
                    "ทั้งเนื้อคู่ก็จะหาได้สมใจ \n" +
                    "ถ้าเป็นชายนายให้ยศปรากฏชอบ\n" +
                    "บุญประกอบมั่นคงไม่สงสัย\n" +
                    "ชันษาชาตาดีนี่กระไร  \n" +
                    "สุขทั้งกายทั้งใจสบาย"

    };
    public String getStick(int index) {
        return sticks[index];
    }
    public int getIndex(){
        index = (int)(Math.random() * (sticks.length - 1));
        return index;
    }

}
